Revit 2024 API
ElementTransformUtils Class
 A collection of utilities allowing transformation of elements (e.g. move, rotate, mirror and copy).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static class ElementTransformUtils
Visual Basic
Public NotInheritable Class ElementTransformUtils
Visual C++
public ref class ElementTransformUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementTransformUtils
See Also
ElementTransformUtils Members
Autodesk.Revit.DB Namespace